[
  {
    "path": "posts/2022-02-27-yes-and-is-the-foundation-of-collaboration/",
    "title": "'Yes, and...' is the foundation of collaboration",
    "description": "How the rules of comedy improv can improve your collaborations.",
    "author": [],
    "date": "2022-02-27",
    "categories": [],
    "contents": "\r\nCollaboration as\r\nImprovisation\r\nCollaboration is a delicate thing. It needs to be nurtured and\r\nencouraged, especially in the early stages. It is easy to destroy it if\r\nyou go in with the wrong expectations and attitude.\r\nA lot of what I have learned about collaboration can be summed in the\r\n“Yes, and…” rule of comic improvisation:\r\n\r\nThe basic concept of these two words is that you are up for anything,\r\nand will go along with whatever gets thrown your way. Essentially, you\r\ndon’t use the word “No” in improv very often! The “And” part comes in\r\nwhen you are in a scene and can add to what your\r\npartner started rather than detract from it. - Second\r\nCity\r\n\r\nIn collaboration, you need to build on what your partner is\r\ndoing. Doing so requires openness and lack of ego. You are\r\nextending and supporting each other. You are creating something new in\r\nyour journey together, and it will not be like what you do on your own.\r\nThat is a wonderful thing.\r\nThis is obviously the opposite of what we’re taught in academia. In\r\nacademia, we’re taught that we need to analyze things and take\r\nthem apart.\r\n\r\npreserveceee8bc1ab60c650\r\n\r\nUsing the “Yes, and…” rule, we are synthesizing instead of\r\nanalyzing. We are putting things together, taking risks, and hopefully\r\nhaving fun and being energized on the way.\r\n“Yes, and…” IRL Example\r\nWhat does the “Yes, and…” rule look like in real life?\r\nAs an example, I worked with other members of the OHSU’s Educator’s\r\nCollaborative. We were having a discussion during our virtual coffee\r\nbreak about how we can best support online students during COVID.\r\nEventually, we realized that we wanted to work on something together.\r\nWe wanted to show fellow educators concrete advice on how to support\r\nstudents.\r\nThrough talking some more, we identified ways of doing this: encouraging\r\npsychological safety through a code of conduct, providing a forum\r\nand space for student support in courses, and identifying open\r\neducational resources to utilize in courses rather than making students\r\npurchase expensive textbooks.\r\nThe result was an hour-long presentation that came together on these\r\nthemes. It was a really positive experience that leveraged each of our\r\nstrengths and demonstrated concrete and evidence-based steps to support\r\nstudents.\r\nRespect\r\nand Sharing Values is Key to Taking Risks Together\r\nAt the heart of this collaboration was our respect for each other’s\r\nknowledge and values. We knew we could share our experiences and our\r\ndesire to help students.\r\nImagine if one of us proposed something, and another of us just shot\r\nit down. Where can we go from there? Not many places.\r\nBut if we build and encourage each other, we can find new paths by\r\ntaking risks together. Tina Fey had a great perspective on this:\r\n\r\nAdd to the discussion. In the example above, the\r\nsecond person did not just say, “Yes we’re at the beach,” she said, “I\r\ncan’t wait to get in the water, I hope it’s not too cold.” This\r\nstatement adds value to the scene. Now the audience\r\nknows it’s cold and that we plan to enjoy the ocean as opposed to\r\nlooking for gold or taking a yoga class.\r\n\r\n\r\nTo me, this rule challenges you to contribute. Whether you are\r\ndeveloping an ad campaign or deciding where to eat dinner, put\r\nyour neck out there, give your thoughts and have a say. Two\r\nminds are always better than one. - Tina Fey, Bossypants\r\n\r\nIn collaboration, you need to focus on adding value, not\r\nsubtracting from other’s contributions. Don’t judge your\r\ncollaborator’s contributions. Nothing is more demotivating nor more\r\ndestructive of a fledgling collaboration.\r\nEncourage each other, make your own psychologically safe space\r\ntogether. This space can be difficult to establish, but if you respect\r\neach other, it will be ok to take risks together.\r\nTJ and Dave: Tapping Into the\r\nFlow\r\n\r\npreserve9e8fafece83272f3\r\n\r\nAs an extreme example of the “Yes, and…” rule, look at TJ\r\nand Dave, two masters of long-form improvisation. Their shows are\r\ncompletely improvised from scratch each time. Somehow, for every\r\nperformance, they manage to fill an hour and make people collapse with\r\nlaughter. It is creation on the edge of chaos, and they always manage to\r\nmake something.\r\nTJ and Dave talk about their improv as tapping into a flow of events\r\nthat’s external to them, and that the improv is just tapping into that\r\nflow. Ego or who authored what doesn’t come into play - they are just\r\nvessels for this flow. They seem incredibly humbled and grateful to be\r\nable to tap into this, and this keeps their collaboration fresh.\r\nWhen you find a good collaborative partner, you can channel the flow\r\ntogether. It is a form of play, and it is energizing and fun.\r\nAsking\r\nGreat Questions for the Setup: The 2000 year old man\r\nThe 2000 Year Old Man was a comedy routine that Carl Reiner and Mel\r\nBrooks came up with together while working together in a writer’s room.\r\nCarl played an interviewer asking a 2000 year old man (played by Brooks)\r\nquestions about daily life as 2000 year old man, did he meet certain\r\nhistorical figures, etc. It was completely improvised and Mel’s\r\nresponses were usually pretty darn funny.\r\n\r\npreserve0e5040451d237d94\r\n\r\nMel’s responses always got the laughs, but Carl’s role was especially\r\nimportant. He asked the right questions that Mel could build his answers\r\non. His questions set up Mel for success:\r\n\r\nCarl Reiner was a master of the underrated art of the setup. Most\r\n“straight men” are known for their responses that release the laugh.\r\nCarl did that too, but even more brilliantly, he subtly puts all of the\r\npieces into play for Mel Brooks to push off of into the comedy\r\nstratosphere. - Anne\r\nLibrera\r\n\r\nWhat lessons can we apply from Carl Reiner? When collaborating, ask\r\nyourself: how can I ask these kinds of questions and set up my\r\ncollaborators to push off into that stratosphere? How can I set\r\nourselves up to capture lightning in a bottle?\r\nHow to FInd IRL\r\nCollaborators: Share Values\r\nThe best way to find collaborators is to find people who share your\r\nvalues.\r\nThere are a lot of opportunties for this: help organize a conference,\r\njoin a community of practice, find an open-source project that\r\nencourages first-time contributors. Work on putting together a workshop\r\nwith someone - this is a great way to make connections quickly. Be\r\ncurious about other people’s work; that curiosity can be the start of a\r\ngreat relationship. Again, early on, focus on the relationship, not the\r\noutput product.\r\nThe majority of my educational collaborations have come about because\r\nI share values with my collaborators. Wanting to make education more\r\ninclusive and accessible has been a great value to unify on.\r\nIf you meet someone who shares your values and could be fun, try and\r\nfind a way to work together.\r\nIt’s All About Fun,\r\nEnergy, and Connection\r\nCollaboration is an antidote to the loneliness we all feel nowadays.\r\nScience can be a very lonely place, and it sometimes seems that when you\r\npresent ideas to others, there’s always someone who wants to shoot it\r\ndown. (I’ve often felt like a grant could best be defined as a dream a\r\nreviewer stomps to death.) This is very draining.\r\nIn contrast, a good collaboration can be energizing and fun. We may\r\ndownplay fun, but it is an important part of any collaboration.\r\nWe need to know when we need to re-evaluate our collaborations. The\r\ncanary in the coal mine for any collaboration is the question:\r\nam I having fun in this collaboration?\r\nIf this collaboration is something you volunteered to do (that is,\r\nyou’re not being paid), and it’s no longer fun, you have my permission\r\nto drop the collaboration. Life is too short to spend on voluntary\r\nactivities that are not fun.\r\nTL; DR\r\nHere’s a quick list of ground rules that synthesizes the above.\r\nWork with those who respect you and share your values.\r\nValue the collaborative relationship (which is long-term) over any\r\nshort-term products.\r\nUse the “Yes, and…” rule. Add to your collaborator’s contributions,\r\ndon’t detract from them.\r\nTake risks and make something cool together.\r\nSet each other up for success.\r\nHave fun together. Stop if it’s no longer fun.\r\nThank You, Open Science\r\nCommunities\r\nFinally, I want to end on a personal note and express gratitude for\r\neveryone who has helped me on my journey.\r\nAt an especially low time in my life, the communities of Open Science\r\nsaved me, showing me a positive way to do science. This started with Mozilla\r\nOpen Leaders, BioData\r\nClub and Code for Science and\r\nSociety. There are countless others, including rOpenSci, csvconf, RStudio Certified\r\nEducators, RStudioConf, R/Medicine, PDX-R, Cascadia-R Conf, R-Ladies, SDSS, and The Carpentries. Grateful for\r\neveryone I’ve met through participating that showed me a way\r\nforward.\r\nThis post is my love letter to them. Thank you, everyone.\r\nFor More Info\r\nBossypants\r\nby Tina Fey has a great summary of why “Yes, And…” can change your\r\nlife.\r\nRead the oral\r\nhistory of the Upright Citizen’s Brigade to learn more about “Yes,\r\nand…” and Del Close, whose philosophy of performance is the foundation\r\nof theatre sports.\r\nMel Brooks’ Autobiography All about me! is\r\nfull of his kudos for his collaborators, and awe at his education in\r\ncomedy. Highly recommended.\r\nThe Carpentries material has much\r\nmore information about teaching together (search for “Never Teach\r\nAlone” on this page).\r\nGreg Wilson’s book Teaching Tech\r\nTogether has even more information about this.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-02-27T19:39:55-08:00",
    "input_file": "yes-and-is-the-foundation-of-collaboration.knit.md"
  },
  {
    "path": "posts/2021-07-20-life-after-academia/",
    "title": "Life After Academia",
    "description": "After 3 months leaving academia, how am I doing?",
    "author": [],
    "date": "2021-07-20",
    "categories": [],
    "contents": "\r\nWell, it’s been over 3 months since I left my academic position to become a Bioinformatics Trainer for DNAnexus.\r\nFor the most part, it has been a very positive shift. And I do mean shift - there was a bit of culture shock coming to DNAnexus from academia. There are a lot of differences.\r\nI thought I’d summarize my experience here so far in terms of both positives and negatives.\r\nReal positives\r\nMy collaboration skills that I spent a lot of time developing has served me well in industry so far. DNAnexus has a very collaborative culture and there is not that much distance between new employees and senior employees. I also never liked the hierarchy between PhDs and non-PhDs, and there is very little condescension here.\r\nMy desire and passion to onboard students has directly translated to training in industry. There is a need for developing training that uses active learning techniques, and our customers want it. Not all of them are highly technical and used to the cloud, and it is an exciting challenge trying to help them learn what they need to learn.\r\nThere is program management. One of the worst things about being paid under multiple grants was that the sum total of my work was not visible. Everyone was always expecting everything, all the time. I really like how program management here helps to balance everyone’s workload and help them avoid burnout.\r\nRoles and responsibilities are specialized. I like this as one of the best benefits. I don’t have to wear all the hats, so I can specialize and get better at my specialty. I really want to help develop a kick-ass training plan to get more people working efffectively on our platform.\r\nBeing a beginner really helps in developing training. I have to confess that I haven’t stayed 100% on top of the cutting edge of bioinformatics. I am well versed in high performance computing, but transitioning to cloud computing has had a pretty high learning curve.\r\nCulture is a positive force and drives almost everything. Management, including PeopleOps (our version of HR) has been aware that the pandemic has increased productivity, but also that burnout has been increasing. They’ve been trying to be aware of this and instituting blackout days where the office is closed, encouraging employees to unplug. A lot of my understanding of organizations has helped me realize that this is a pretty positive place.\r\nPay and benefits are definitely better than academia. The pay increase is considerable, since they actually value your contributions.\r\nReal Negatives\r\nIt’s not all roses and puppies, however. Here are a few negatives.\r\nStarting is pretty overwhelming. There is a lot to learn. The first two weeks here were dedicated to a very extensive onboarding process. Every quarter, we have a Bootcamp for new employees, and it is about 2 weeks of classes, where we meet people from each team, and learn about the platform. It’s a pretty hardcore onboarding process, which was pretty overwhelming. On the plus side, I have a big picture of how the parts work together and who to ask for help.\r\nYou are specialized and part of a larger plan. I am part of the service organization within DNAnexus, which helps customers implement and utilize the platform effectively. I work with customers who need training, and we provide a set of coursework to get them onboard the platform. This means that my work is always in the context of the organization, and that thinking about my work as billable is important to achieving our goals as an organization.\r\nThe pace is faster than academia. Projects need to be in the context of the overall strategy of the organization. If you can pitch in, you can do some neat things. But your time is valuable, so you have to spend your time wisely.\r\nIn all, was the transition what I expected? I would say yes, but it’s not for everyone. I think that overall, my emotional intelligence serves me much better in the current position than it has in academia, where it was just a way for others to mindlessly take advantage of me. My desire to be a respectful collaborator has served me well so far.\r\nDefinitely do your research and ask the hard questions if you are making the switch. And find other people who are thinking about making the change, and ask others who have made the switch. You will need their support.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-20T12:11:37-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-04-29-moving-on-and-upwards/",
    "title": "Moving On and Upwards",
    "description": "I'm leaving OHSU. The reasons why.",
    "author": [],
    "date": "2021-04-29",
    "categories": [],
    "contents": "\r\nI’m leaving OHSU. I have accepted a position to become a bioinformatics trainer for DNANexus. I am passionate about making sure that people do good analysis, and I’m convinced that DNANexus is the best place for me to make an impact and move away from academia.\r\nAs an bioinformaticist/collaborator who is focused on doing reproducible analysis, the level of financial support I received in academia was difficult to sustain. I didn’t have an R01 of my own; I was often divided between multiple projects where I was faced with the decision of having to triage work and do work I was less proud of. I was spending less time on things I’m passionate about, and more on administration, which was much less important to me. I was also split between multiple departments and meeting the expectations of everyone was way too difficult for me.\r\nHaving multiple bosses, I was also forced to adopt the survival strategy of not disappointing the same person in a row. I never felt good about that, and I’m tired of feeling that way. I could not see my career as being sustainable, nor did I ever consider myself someone who would be promoted in the current environment. The university did not recognize the level of collaboration that I dedicate myself to, nor does it priortize this level in terms of promotion and tenure criteria. So I never felt sure whether I was on the path to promotion.\r\nA lot of what I’ve tried to accomplish has been fueled by a deep anger by what happened to me during my dissertation process. My dissertation advisor was unsupportive and I had a toxic dissertation committee. But I can’t make these feelings the cornerstone of my future life.\r\nI’ve tried to make academia less painful through efforts such as Cascadia-R, BioData Club, and my workshops and courses. I still believe that learning should be less lonely and that fighting impostor syndrome is something that should be done in a supportive community. I will continue to be involved with both in a limited capacity.\r\nI will always be grateful to my students and TAs for their fresh perspectives and energy. I hope you will continue on with that enthusiasm. I hope that I have inspired you, at least in a small way. I am also grateful for all the faculty, staff, postdocs, and everyone in the open science, data science and R communities who have been supportive of me in my journey, and who have helped me arrive at this decision.\r\nI don’t want my decision to be an example for others. I don’t want to discourage others in their pursuit of an academic career, if that is what their heart is set on. But please be aware of the potential downfalls of such a path. The high rejection rates for funding. The low percentage of us who are destined for stable careers in academia. You need to find your own way, and you will probably do a better job of finding funding than I did. Get to independence through securing your own funding as fast as possible, or start building those marketable skills.\r\nIn the coming months, I will probably release less R material, due to my focus on bioinformatics training. I love R, but I have given more than I have recieved back and I need to focus on myself for the time being. I’ve depleted myself over the last year and I need to recharge. Hopefully you will respect that.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-06T10:13:02-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-03-18-updated-blog/",
    "title": "Updated Blog",
    "description": "Reasons why I moved over to {distill} for my blog.",
    "author": [],
    "date": "2021-03-18",
    "categories": [],
    "contents": "\r\nI’ve imported most of my blog posts over from my Hugo/Blogdown blog over to this new {distill} site.\r\nWhy? {distill} is much more lightweight and easier to maintain. If I want, I can drag over articles from tidytuesday explorations or such and easily link to them. The {blogdown} workflow was really becoming a pain, especially in maintaining different Hugo versions, and honestly, the page was getting much too busy.\r\nSo, really, theoretically, you should see more content from me soon.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T20:31:17-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-10-14-setting-boundaries-and-saying-no/",
    "title": "Setting Boundaries and Saying No",
    "description": "How saying no can be the best self-care.",
    "author": [],
    "date": "2020-10-14",
    "categories": [
      "self-care"
    ],
    "contents": "\r\nI hate saying no. But as I go on in life, I realize that I can’t be all things to all people. I want to help people, but I also have to have enough energy to get through the day.\r\nIt’s easy to go through life doing what everyone expects of you and have nothing to show for it. In fact, this is often the curse of hyper-competent people. People tend to see you as a gear that fits within their own vision and expect you to do things for them.\r\nI want to outline an approach that will make it easier to say no. It starts with understanding yourself.\r\nWhat are your values? Who are you fighting for?\r\nIn order to say no, you have to have clarity on your values and goals. What do you see your life as?\r\nHere are some of my values:\r\nMake doing data science inclusive, accessible, and fun\r\nIntroduce people to data science who hadn’t seen it before\r\nIntroduce useful and applicable data science skills that learners can provide\r\nTeach others about lifelong learning and participate and foster learning communities in Data Science\r\nAn equally useful question to ask yourself is who are you fighting for? In my case:\r\nUnderrepresented Minorities\r\nLGBTQ folks\r\nMyself and my husband\r\nI will say that as I get older, I have achieved greater clarity about what matters to me, and what doesn’t matter to me. This clarity helps me understand what is and what isn’t important to me.\r\nDon’t respond to requests right away\r\nIf you don’t want to add to your workload, I beg you to not give an answer right away. You need to check in with your feelings.\r\nHere is a boilerplate response if you need something to work off of:\r\n\r\n“Thanks for thinking of me with this opportunity. However, I am extremely busy at the moment. I need to evaluate my current workload in order to tell you yes or no.”\r\n\r\nThis buys you time to think and understand about how you feel about the request. Also, it gives you time to compose a thoughtful reply.\r\nAsk Yourself: Is this in line with my values/goals?\r\nTake a deep breath, and ask yourself how you feel about the request.\r\nDoes it help further your goals or the people you’re fighting for? Will it upset your current work/life balance? Are you willing to pay that price?\r\nIf the answer is no to all of these, then the answer is no. No matter how noble their goals, if they don’t fit with yours and your current workload, you should probably say no. You can leave the door open for future collaborations, though.\r\nThe first few times, it may be agonizing to do this. But consulting your feelings about something will become second nature to you.\r\nGently Say No. Don’t Feel Sorry.\r\nHere’s the thing: it is way easier to say no when the request doesn’t align with your values or it doesn’t benefit who you’re fighting for. It gives your response much more force.\r\nYou may need to do a little verbal/email jujitsu here, because some people don’t hear no. Use absolutes for right now, but keep the door open if you see yourself possibly working together in the future.\r\nMore boilerplate:\r\n\r\n“I really appreciate you thinking of me. However, I cannot help with your effort at the moment. I am trying to maintain work/life balance, and this would upset that. \\[I hope you'll consider me for future efforts.\\]”\r\n\r\nYou don’t need to provide more personal reasons than the above, especially if the requestor is a stranger.\r\nBoundaries Keep You Sane\r\nSaying no doesn’t feel good. But the more you do it, the more you can achieve work/life balance.\r\nYou can’t be everything to everyone, and you will end up dissappointing people. But you should feel okay about that, especially if their efforts are outside your own goals.\r\nI have to admit that I’m still learning how to do this. I’ve written this as much for myself as for others.\r\nFurther Reading\r\nParts of this article are adapted from Unfuck Your Boundaries by Faith Harper. Her advice is no-nonsense, but it does require some soul searching to really utilize her advice.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T20:14:22-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2019-09-23-kindness-at-the-cost-of-yourself/",
    "title": "Kindness at the Cost of Yourself",
    "description": "Being overdrawn at the bank of kindness and self-care.",
    "author": [],
    "date": "2019-09-23",
    "categories": [
      "self-care"
    ],
    "contents": "\r\n\r\nIn healthy cultures, people rise by elevating others and fall by undermining others. In toxic cultures, people are forced to choose between helping others and achieving success. Choose the workplace where success comes from making others successful. - Adam Grant\r\n\r\nWhen I read Adam Grant’s Give and Take, it was like a light went off. In this book, Grant gives profiles of highly successful people who are givers - people who have changed their field by making things better for others. I immediately connected to this idea of giving. Here was a way to network with people that really worked for me. Giving and connecting people are what I do best. I like to help people achieve their goals if I know someone else who can help them.\r\nAnd no doubt, embracing my identity as a giver has helped change my career trajectory - in the last few years, I co-founded Cascadia R, produced the R-Bootcamp with Jessica Minnier, and have met so many people in the field of education and open science that I want to work with and who have inspired me.\r\nHowever, as I’ve noted before, I tend to be giving to the point of being self sacrificing, which is not good. I’m reminded of the end of Kafka’s Metamorphosis when (spoilers) as Gregor Samsa dies in his bug form. As he dies, he worries about the agency of his family. Will they be able to support themselves? In the end, the family that he was worried about finds jobs, support themselves and thrive in the end. Without him. One interpretation of this story: no one is so irreplaceable in this world.\r\nThis Spring, I probably gave a little too much to my Health Analytics class, to the point of being self-sacrificing. This shouldn’t be a reflection of the class - they were great and really whip smart - I just tend to give a little too much. As a result, I was pretty drained by the time I got to Summer quarter. I’d definitely overdrawn on giving - I was pretty wiped out through the summer. Being overdrawn actually meant I didn’t have enough energy to teach as well as I would have liked - and I felt worse for this.\r\nThe lesson I’ve learned this summer: If you find yourself giving to the point of self-sacrifice, you need to ask yourself why you are sacrificing so much of yourself. Excessive self-sacrifice seems to occur when your self-esteem is tied to the perception of yourself by other people. Meaning, you should question why you are self-sacrificing. Is it because you feel like you need the approval of others? No one’s approval is worth overworking yourself over.\r\nSo, self-sacrifice is ultimately bullshit. Ironically, being self-sacrificing can lead to feelings of helplessness and resentment from the people you are sacrificing yourself for. Additionally, being highly proactive and championing change can actually have negative effects if your actions are perceived as a threat to your organizational culture. There’s a reason why change management is important. No one person can be a revolution - it takes others to do so. It shouldn’t fall to just being on you.\r\nYou need to take care of yourself and protect yourself from the takers. As Faith Harper writes in Unf#ck Your Adulting, “taking care of yourself does the world a favor”. Taking care of yourself means that you can do good in the world sustainably, and continue to do it, rather than burning out.\r\nUnderstand that the notion of true giving is not rooted in self-sacrifice. Giving is in the spirit of generosity; in contrast, self-sacrifice is more akin depleting one’s own resources. As a giver, your generosity should be recognized and not exploited.\r\nOne thing to be aware of as a giver is passion exploitation, where people and organizations will take advantage of you because of your passion for a subject as an opportunity to pay you much less than you’re worth. Such an attitude is prevalent in creative industries, where one is encouraged to work for free or “exposure” (I don’t really do soundtrack work any more because of this). As if being a poor artist or creative was a privilege. Such situations will drain your passion and your energy and burn you out with nothing to show for it. Again, you have to keep something for yourself.\r\nIf you want to continue to do good in the world, you must take care of yourself. This is especially the case in a toxic work culture. You have to build reserves - never give more of yourself than you can. Especially do not do this in a work setting. It is amazing how self-sacrifice can become the status-quo and what is expected of workers. No one is well off because of that. Toxic work cultures encourage this: crunch time as the norm at game studios, overwork at Japanese Black Companies, even in the non-profit sector.\r\nIn short, I believe in kindness and giving. But the kindness and giving must be sustainable. You must defend yourself from those who would take more than they give, and avoid being exploited by those who see your passion as something exploitable. Identifying these people and organizations and saying no is key to taking care of yourself while making things better for others. Don’t feel guilty about this. Don’t make self-sacrifice part of your identity or job description.\r\nResources\r\nGive and Take - this is the book that opened my eyes to the power of being a social giver.\r\nUnfuck Your Adulting - this book by Faith Harper is full of good advice about navigating situations, emotions, and taking responsibility for what you can take responsibility for.\r\nHow to be a giver, not a self-sacrificer - talks about giving in the spirit of generosity, and not self-sacrifice. Again, keep something for yourself.\r\nWhen to take initiative at work, and when not to\r\nAvoiding Burnout: Tips for self-care - again, very good tips on taking care of yourself, because no one else will.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T20:10:03-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2019-07-03-burning-out-and-recovering-slowly/",
    "title": "Burning Out and Recovering (slowly)",
    "description": "How I'm recovering from burnout.",
    "author": [],
    "date": "2019-07-03",
    "categories": [],
    "contents": "\r\nLast year about this time, I had a meltdown, which is a symptom of burnout. I’d like to explain a little bit about my burnout in the hopes that other people can avoid it.\r\nI want to help people, and I’m a people pleaser. I’m a giver, and sometimes I give too much, to the point I have nothing left. I have to be aware when people exploit this. One collaboration, unfortunately took advantage of my giving nature.\r\nI was on a contracted project where I used some of the time to build an open source project to enable our research. With our collaborators, I showed them my work and they seemed excited. Unfortunately, this “excitement” turned into unreasonable demands. I was literally trying to do a full time development position while balancing the demands of other projects, including teaching. I started feeling like a machine, where each of my collaborators just wanted me to output figures and analyses.\r\nThe worst I’ve ever felt is when I have been busting my ass for things I don’t believe in, or have been stretched across too many projects. Unlike a lot of faculty at OHSU, I don’t have my own R01. I am a collaborator, and I work hard at it.\r\nThe wake-up call for me was persistent thoughts of suicide. I realized that I didn’t care that much about anything and I knew that things had to change.\r\nRegaining Balance\r\nThe past year has been about finding my way back. I’ve been trying to do the following to regain my balance:\r\nWorking 4 days/week instead of the usual 5. On my “day off”, I try my best to contribute to open source projects, work on music, and do other things that recharge me. This has enabled me to say no more often.\r\nUnderstanding my values and restructuring my work to fit it. I’m much more focused on education, outreach, and mentoring these days. If a project comes up, I have to ask myself whether it is in line with my values. I’d like my research to include educational and data exploration components, such as Shiny.\r\nNot putting all my eggs in the work basket. I’m an artist in addition to being a data scientist. I play the cello, compose, and do photography. I make more time for these.\r\nRealizing that excellence does not require self sacrifice. I try to stop working on things obsessively, and only within the time I’m paid.\r\nMindfulness work. I’ve been using the Calm app to help me reorient me and not immediately react to adversities I encounter.\r\nGiving up on perfection. I’m learning to slowly abandon perfection on projects I don’t care that much about (more on this later), and instead turn my alerts off, or only respond to them within sane business hours.\r\nAm I Recovered?\r\nI’d like to say I’m fully recovered, but I’m not. I’m not sure I’ll ever be 100% recovered, if recovered means the insane productivity levels I was showing before. I have been slowly asking myself whether projects expect insane levels of work for the amount of time I can dedicate to them.\r\nThankfully, I have had really great support from my department and from the university overall throughout. I have had support from the communities I help manage (BioData Club and Portland R User Group), and all the great people involved in open science that I have met (rOpenSci, Mozilla, The Carpentries).\r\nI would say that this support has been wonderful, and I feel like the journey back from research burnout has been ongoing. I wish there was a magic bullet for burnout, but working one’s way out of mental and emotional exhaustion ultimately takes a lot of time.\r\nResources\r\nIf you are burned out, please seek mental health assistance if you need help.\r\nThe Telltale Signs of Burnout - How to recognize when you’re burned out.\r\nMayo Clinic on Burnout - More information on Burnout.\r\nResponding to Burnout. How can we recognize burnout in others?\r\nWorkLife Podcast - This podcast by Adam Grant (organizational psychologist) has been full of ideas on how to make what I work on more meaningful. Highly recommended.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T18:07:15-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2019-01-24-rstudio-conf-2019-education-and-organizations/",
    "title": "Rstudio Conf 2019: Education and Organizations",
    "description": "Some notes about RStudioConf 2019.",
    "author": [],
    "date": "2019-01-24",
    "categories": [
      "conference"
    ],
    "contents": "\r\n\r\n\r\nknitr::include_graphics(\"poster_laderast.png\")\r\n\r\n\r\n\r\n\r\nWell, RStudio Conf 2019 has come and gone. I attended the main conference, starting with the poster session on wednesday and stayed through the tidyverse developer day on Saturday.\r\nTo say that the conference was inspiring was an understatement. So many talented people working on such interesting and inspiring packages! It made me excited again about doing data science and teaching data science.\r\nThis post is going to highlight the interesting talks about education and organizational management at the conference. There were lots of thought provoking talks and great resources about education. Here’s a link to the other resources, posters, and talks (thanks, Karl Broman!). There are a lot of new neat whiz bang features in RStudio, which I won’t cover, but are covered very well by others at Karl’s link above.\r\nUPDATE: I’m adding links to the videos as subheadings that you can click on. I won’t embed these directly because there is often related material with the video.\r\nAvailable Teaching Resources\r\nThere was much sharing of educational resources. I’ll talk about a few.\r\nCarl Howe’s Talk: The Next Million R Users\r\nMel Gregory: RStudio for Education\r\nCarl Howe (Director of Education for RStudio) presented a number of resources that RStudio is providing for educational purposes. Their goal is to train the next million R users. Here are some of the RStudio based educational resources that might be useful for everyone.\r\nRStudio Cloud is now available free for people who teach courses, who can send them a course syllabus to gain access. RStudio Cloud includes resources to make coursework publically or privately available, allows instructors to install default packages, and gives students an immediate way to start playing with R/RStudio. We are definitely going to use this in teaching our BMI 569/669 Data Analytics course. Mel Gregory’s talk was about the nuts and bolts of using RStudio Cloud in a classroom situation. Highly recommended to get familiar with the basics.\r\nMine Çetinkaya-Rundel also has a Data Science In a Box course available that can be forked and used by anyone. There is a great discussion of how to use the course and the tech stack (RStudio Cloud, GitHub, and Slack) needed to make the course runnable.\r\nThere are also a number of LearnR Tutorials built into RStudio Cloud called RStudio Primers that cover a lot of basic RStudio operations for the self-directed learners.\r\nJessica Minnier and I presented at the poster session about our LearnR tutorials, DSIExplore and dataLiteracyTutorial and our burro package, which lets users explore a new dataset with a simplified Shiny App. There’s even a function that lets you build a shiny app from a dataset that you can publish to a Shiny server such as shinyapps.io or RStudio Connect for sharing and having a data scavenger hunt together. Or as Angela Bassa calls it, an EDA Party. Whoo!\r\nIrene Stevens’ Talk: Teaching Data Science With Puzzles\r\nI really loved Irene Stevens’ talk about Teaching Data Science Using Puzzles. Irene and Jenny Bryan put together a simple project-based framework that lets students download simple data wrangling puzzles per week, lets them submit their answer to an answer server and get feedback, and when they solve it, it creates a minimal reproducible example (reprex) to share with their puzzle community. Very Slick!\r\nKelly Bodwin: Introductory Statistics with R\r\nKelly Bodwin gave a presentation of how she used Shiny apps as an intermediate step as part of an approach to teaching introductory statistics. Kelly is of the opinion that coding is good even for non majors, and her Shiny apps provide an intermediate step between a more click-based app and coding, asking the students to input their variables, their hypothesis, and highlights the output that results. I really liked this approach. I also really loved this slide:\r\n\r\nDiversity and Inclusiveness Make for Better Data Science\r\nJesse Mostipak: R4DS online learning community: Improvements to self-taught data science & the critical need for diversity, equity, and inclusion in data science education\r\nI really enjoyed Jesse Mostipak’s talk about her data science journey starting the R For Data Science (R4DS) learning community. She especially emphasized that data science was her path out of lower incomes and that she thought it needs to be more accessible to all. She talked about the barriers to going from “Using your computer for Netflix” to “Using your computer for data science” as real, and what she learned as a community manager for the R4DS learning community. Finally, she ended with a call for data scientists to share their mistakes, in order to model that making mistakes is ok.\r\nCaitlin Hudon: Learning from Eight Years of Data Science Mistakes\r\nSpeaking of mistakes, Caitlin Hudon gave a talk called “Learning from Eight Years of Data Science Mistakes”, which was really helpful. One of her messages was that “Mistakes count as experience”, and learning from past mistakes is extremely helpful for the whole team. However, it must be safe for team members to share their mistakes, and so creating the right culture of respect and teaching is important. This includes documentation, and including pseudocode next to the actual code to talk non-data scientists through is important. Likewise, making sure that you are solving the correct business problem requires communication. I really liked her discussion of the Rhetorical Triangle as a way to frame communications: Speaker, Audience, and Context.\r\nTracy Teal: Teaching R using inclusive pedagogy: Practices and lessons learned from over 700 Carpentries workshops\r\nTracy Teal from Data Carpentries also talked about their efforts to Teaching R using inclusive pedagogy, including fostering a growth mindset. Their instructor training is a wonderful 2-day crash course in teaching, and I’m going to propose that it be offered to our graduate students to prep them for teaching. (Full disclosure: I’ve contributed to these course materials.) I also appreciated how candid she was about how much further they need to go to increase the diversity of participants.\r\nDiversity and Inclusiveness was also a theme of Angela Bassa’s talk about Team Data Science. She pointed out that data science teams need to be diverse to serve audiences who are highly diverse.\r\nMaking Teaching Resources for Community College Instructors\r\nMary Rudis: Catching the R wave: How R and RStudio are revolutionizing statistics education in community colleges (and beyond)\r\nA really interesting talk for me was Mary Rudis’ talk about her work teaching data science at the community college level. As head of the math department at Penn State Harrisburg, Mary has done a lot of work developing the first data science certification at the community college level. There are a lot more people attending community college than 4 year colleges, and we need to make paths to data science accessible for these students.\r\nA lot more work needs to be done to make data science accessible at this level. Mary has pointed out a number of efforts that need help, including StatPREP and the American Mathematical Association of Two Year Colleges. She also ended with a call for Shiny Developers to help Community College instructors develop tools they can use to teach data science.\r\nOrganizational Considerations in Data Science\r\nJoe Cheng: Shiny in Production\r\nTonya Filz: The Resilient R Champion\r\nOrganizational considerations were also a really interesting part of RStudio Conf for me. Joe Cheng’s keynote on Shiny in Production spent some time talking about overcoming resistance to Shiny in your organization, including talking with Data Engineers and IT Security. His point was that oftentimes, resistance comes from the feelings of territorialism and how to overcome them. Tonya Filz also gave a talk about being a Resilient R Champion at your organization, stressing these issues and giving us case studies/examples to show leaders at your organization.\r\nHilary Parker: Cultivating creativity in Data work\r\nHilary Parker’s talk about Creativity and Data Science in the Organization, about applying system design principles to data science. Rather than thinking of ourselves as having a traditional role at the end of the analysis, Hilary suggested that we partipate in all parts of the process, including data collection. Her group suggested a change in an app, which resulted in a brand new data stream for them to analyse.\r\nAngela Bassa: Data science as a team sport\r\nAngela Bassa’s Talk about Team Data Science talked about the organizational aspects of making a data team, including specializing roles, making sure that knowledge and expertise was distributed, and managing burnout by making sure that no one team member is overloaded. She stressed resilience within a team by making sure that people are taking care of themselves, having redundancy in the team. Process is also important, by making sure data is well documented, by allotting time. She also stressed the importance of young and new data scientists to the team, because they aren’t biased with previous knowledge. I also thought she had excellent arguments about the cost of not expanding your data team - potential users who would be lost.\r\nEncouraging a Growth Mindset\r\nPanel: Growth & change of careers, organizations and responsibility in data science\r\nI really enjoyed the final panel discussion, which was about encouraging a Growth Mindset for Data Scientists in their careers. Karthik Ram, Tracy Teal, Angela Bassa, and Hilary Parker all fielded questions about growing as a data scientist. One of my favorite remarks was from Tracy Teal, who mused about the possibility of a Leadership Carpentry, teaching potential leaders essential skills such as mentoring, faciliation skills, and valuing team contributions. Angela Bassa also had a great quote that “leadership is programming people”. She also pointed out that the role of Data Scientists is to “Question Dogma” and pointed out the importance of saying “I don’t know”.\r\nDavid Robinson: The Unreasonable Effectiveness of Public Work\r\nMaking your work publicThe growth mindset was also a theme of Dave Robinson’s Keynote, which was about making your data science work public at a number of levels. He outlined a number of different types of public contributions, such as short form (tweets, discussions about data), long form (blogs), code contributions, and even writing a book.\r\nDirect Explicit Instruction in Education\r\nFelienne Hermans: Explicit Direct Instruction in Education\r\nFelienne Hermans gave a wonderful keynote about teaching computer programming. I won’t crib her story, because her telling it was a delightful journey and I encourage you to watch it for yourself at the link above. Part of her point was that programming pedagogy is dominated by the “tyranny of fun”, rather than focusing on teaching fundamentals. One of the problems with programming education is that we haven’t defined what these fundamentals are, compared to the pedagogy of reading, which talks about teaching with fundamentals such as phonics.\r\nWe expect students to explore things without teaching them enough, and that actually hurts their progress. Instead, we should also be teaching fundamentals, such as code reading out loud and rote memorization of programming patterns. By utilizing these fundamentals, she has found improved learning outcomes. As she says, motivation comes from seeing progress, not necessarily from exploration alone. Her results on using direct instruction have showed improved outcomes in terms of motivation.\r\nI have to admit that this talk really opened my eyes to the blind spots we have in programming education. Looking forward to incorporating these ideas in my coursework.\r\nSo Many People to Teach, So Many Ways to Teach!\r\nSo that’s my summary about the education and organizational talks/posters at RStudio Conf. Hopefully it gives you an idea of what resources, opportunities, and pedagogy is out there.\r\n\r\n\r\n\r\n",
    "preview": "posts/2019-01-24-rstudio-conf-2019-education-and-organizations/poster_laderast.png",
    "last_modified": "2021-03-19T20:04:16-07:00",
    "input_file": {},
    "preview_width": 1067,
    "preview_height": 801
  },
  {
    "path": "posts/2018-10-15-clinical-data-wrangling/",
    "title": "Things we learned teaching clinical data wrangling",
    "description": "More information about managing depression and anxiety.",
    "author": [
      {
        "name": "Eilis Boudreau, Ted Laderas, and Nicole Weiskopf",
        "url": {}
      }
    ],
    "date": "2018-10-15",
    "categories": [
      "visualization",
      "R"
    ],
    "contents": "\r\n\r\n\r\n\r\nWell, we just finished our clinical data wrangling workshop. This was a 12 hour workshop (spread over 4 days) where students got to work with a real research dataset (the Sleep Heart Health Study data). This is a workshop that we developed as part of an National Library of Medicine T15 training supplement in Data Science. The following is a short report describing the workshop and its outcomes.\r\nIntended Audience\r\nWe designed the workshop for our incoming informatics students (both clinical and biological majors) in order to introduce them to the difficulties of working with clinical data.\r\nLearning Objectives\r\nThese were our learning objectives for the workshop:\r\nUnderstand the biology of sleep and sleep apnea and how the biology informs the covariates measured in the Sleep Heart Health Study\r\nUnderstand why clinical data is useful and also why it’s difficult to work with\r\nLearn Exploratory Data Analysis techniques and use them to inform model building.\r\nLearn to assess logistic regression models using simple diagnostics.\r\nThe Dataset\r\nWe used the Sleep Heart Health Study dataset from the National Sleep Research Resource. This is a dataset of approximately 5800 patients that have over 3000 covariates. We limited our students to a smaller number of covariates (17), including our outcome of interest, cardiovascular disease.\r\nWorkshop Format\r\nWe designed the workshop to be a mix of didactic lectures and active learning exercises. Where possible, we had students work in groups to answer questions about the data. These activities included a data scavenger hunt using our EDA exploration app, and a logistic modeling exercise.\r\nDay 1 Outline\r\nIntroduction, logistics, and groups assigned (30 minutes)\r\nBiology of Sleep and Cardiovascular Disease (40 minutes, format: in-person lecture)\r\nBreak Time (15 minutes)\r\nThe Value of Clinical Data (15 minutes, in-person lecture)\r\nClinical Data Quality (40 minutes, in-person lecture)\r\nLunch (90 minutes, with optional R setup session)\r\nExploring the SHHS Dataset (60 minutes, format: Data Scavenger Hunt w/ Shiny App, each team gets a task and has to show the class how to find the information)\r\nApplying the Clinical Wrangling Process: Diabetes (45 minutes, format: in-person lecture)\r\nLogistic Regression Model Basics (60 minutes, format: walkthrough of R Notebook)\r\nDay 2\r\nQuestion/Answer session about Logistic Regression and Modeling (50 minutes)\r\nAssignment about race variable (assigned to groups, take-home assignment)\r\nDay 3\r\nDiscussion about race as a covariate, sharing of findings\r\nOverview of hypertension and how it relates to cardiovascular disease and sleep apnea\r\nTemplate/R Notebook given for final presentation in groups (in-class lab time, template is structured as a series of decisions.)\r\nDay 4\r\nGroup presentations about covariate decisions and resulting model (1 hour, present final version of R notebook). At each decision stage, teams must decide on whether or not to include covariates or not given what they have found from exploring the data and justify their decision using EDA visualizations.\r\nLessons Learned\r\nOverall, we believe the workshop went well, as it encouraged discussion about data and its appropriateness among the students. Students were engaged overall and asked lots of questions.\r\nThe final reports for each group were generated from a R Notebook. All three groups showed a thoughtful narrative and justification for each of the covariates included in the model.\r\nInteractive visualization removes barriers to understanding issues in data. Ted developed a Shiny App that allowed the students to visually browse and understand the data. Along with the EDA scavenger hunt (see below), this served as a good introduction for students to get their feet wet with the SHHS dataset.\r\nOur diverse backgrounds helped make the workshop accessible. Nicole Weiskopf has a background in data quality of clinical data, Eilis Boudreau does sleep study work, and I’m a bit of a mongrel.\r\nSecuring the cooperation of the data holders made the workshop possible. The dataset comes from the National Sleep Study Resource. Eilis knows Susan Redline, who heads that group and pitched the idea (over two sessions) to her group. Susan’s group was very enthusiastic and helpful, especially in helping the students get their data use agreements in so they could access the dataset.\r\nGroup work is learning work. We assigned each student to a group, and gave each group questions to answer and teach the class about the dataset. By pointing them to specific aspects of the data, we opened the door to discussion.\r\nEDA scavenger hunt. We had the students learn data exploration by giving them a scavenger hunt to look at the relationship between variables. Each group was then required to talk about their findings and which visualization helped them discover that relationship. For example, there is a relationship between age and race in our dataset; the “Other” category of race has a lower median age than the other two categories, “White” and “Black”.\r\nDidactic Teaching is also important. Nicole and Eilis covered both the biology of sleep apnea and the difficulty of understanding the implications of clinical data. Without this background, students would not be able to make informed decisions about their final model.\r\nGuide the Students, but don’t force discussion. This was important. We think the students need to connect the dots to really understand the issues. The final product (a logistic regression model predicting cardiovascular disease with an R Notebook) had steps and choices. But the choices for each group of students was different.\r\nA Code of conduct is necessary and important. We are big believers in psychological safety. If people don’t feel safe in the classroom environment (and let’s face it, grad school classrooms rarely are), they will be less likely to learn and contribute.\r\nData restrictions made deploying difficult. The activity materials were deployed as an RStudio project. However, we couldn’t share the data within a GitHub repo. As OHSU’s approved vendor is Box, we setup a box folder containing the material to be shared with students.\r\nWe were grateful for the incoming informatics students’ enthusiasm and patience as we got this workshop going. Also thanks to the NLM T15 Supplement in Data Science, without which we would not have gotten the opportunity to conceptualize, put together, and deliver this workshop. Thanks again to Susan Redline and the National Sleep Research Resource group, especially Dan Mobley who helped us with the last-minute data use agreements.\r\nLink to Workshop: https://github.com/laderast/clinical_data_wrangling\r\n\r\n\r\n\r\n",
    "preview": "posts/2018-10-15-clinical-data-wrangling/appview.jpg",
    "last_modified": "2021-03-19T19:56:56-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2018-06-25-asking-for-help-to-get-better/",
    "title": "Asking for help to get better",
    "description": "Learning more about managing burnout.",
    "author": [],
    "date": "2018-06-25",
    "categories": [],
    "contents": "\r\nI want to thank everyone who has reached out to me after I wrote my post on struggling with my depression and self-care. I am incredibly grateful for everyone’s concern about me. I wrote that at a low point in my life because I had to. I was suffering too long in silence, and I needed to do something. Writing that post was incredibly scary. I am still worried that it may be used against me somehow down the line when I am reviewed for tenure. But the truth is that I’m not a productivity machine; I can be extremely dependable in very uncertain situations, but to do that I need support.\r\nI wanted to start the conversation because mental health is not something we talk about much in academia. There is still a lot of bias and stigma against those with mental illness, that they are “weak”, or that they should “get out of academia”. This stigma prevents a lot of students and postdocs from seeking the treatment they need. I just want to say this to everyone who is struggles with mental illness: you aren’t weak, and you aren’t alone. As far as I am concerned, each of you that manages to get through your day despite of your illness should be considered a hero. Because I know how hard it can be to even get out of bed some days. And I would like for PIs to consider that your overall neglect and/or bad advising can contribute to your student’s decline in mental health.\r\nThank you to all my students, my colleagues, alumni, and everyone in my department (including my department head and division head) who are supporting me. Your kindness and sharing your stories about your struggles really has meant a lot to me. I’ve come to realize that I have an amazing support network and that I just need to ask for help. I am slowly figuring out what that help is. I’m going to 0.8 time for a while to give me more breathing room. I’m exhausted and I just need some time to replenish my energy and reflect where I want to go next.\r\nI have come to realize that saying yes when I shouldn’t comes at a cost to myself and my mental health. Everything I do comes at a cost; I need to have a better gauge of when that cost is worth it, and how much mental reserve I have in my tanks. When my collaborators don’t understand the amount of work I do cleaning their data, when they don’t respect the work I have done managing their data and reconciling the issues with data collection, that’s when I feel like working in research is not worth it.\r\nOne of my industry collaborations was like that, and it pretty much drained nearly all of my energy. I don’t like working with people who expect me to give them an answer and aren’t willing to educate me about what I’m supposed to be looking for. I also don’t like working with people who take advantage of my work in open science to further their own work agenda. I need less of these kind of collaborations, and I need the gumption to walk away from them.\r\nI just want to say this: I am not a rock. I am not strong. But I am a good advocate for others, especially those I feel who have been dealt an unfair hand. I realize that I need to advocate for myself right now. Thank you to other academics such as Dr. Emily Hencken Ritter, who wrote about her struggles with depression and what help she asked for. I’m going to highlight posts about this using the hashtag #DepressionInAcademia on Twitter.\r\nIn short: I’m not going to get better overnight, but I’m trying to take steps to get better. I’ll be taking a little time off this summer as well to recharge and figure out what’s next. I’ll try to chronicle what works for me and to highlight other people’s writings about this.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T19:47:29-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2018-06-09-cascadia-r-2018-how-we-planned-it/",
    "title": "Cascadia-R 2018: How we planned it and the reasons why",
    "description": "More information about the 2018 Cascadia-R conference.",
    "author": [],
    "date": "2018-06-09",
    "categories": [
      "conference"
    ],
    "contents": "\r\n\r\n\r\n\r\nWell, Cascadia-R 2018 has come and gone. This year we tried our best to make it as inclusive, welcoming, and friendly as we could. Considering we had 224 participants this time around, I’d say it was a success.\r\nI just thought I would do a little write up of some of the things we did and why we did them in our conference. I’m hoping it will be useful for other conference planners to create a welcoming environment.\r\nWe created a pull plan based on what we learned last year. Because last year was pretty chaotic in terms of planning, we decided to try to make a pull plan this year. Pull planning is a project management technique in which you work backwards from absolute deadlines (from the day of the conference). Doing so spaces out a lot of the work and makes things potentially more dividable across a group. I’ve made our pull plan public so other conference planners can see what we did and the timing it took to organize the conference.\r\nFind sponsorship money. We ran last year on a shoestring, using only about $3500. We realized that to make the conference more inclusive this year, we had to get sponsorship money. Childcare and diversity scholarships cost money. We wanted sponsors who had values that aligned with our inclusion goals. Lilly Winfree was especially great at finding sponsors who were in tune with what we wanted to accomplish with our conference. Sponsorship also allowed us to pay for lunch for everyone, which we couldn’t last year.\r\nProvide childcare. We wanted parents to be able to attend, so we got DivCare to provide childcare for them in our building. DivCare provided childcare for 8 children, and we had some grateful parents who were happy they could attend.\r\nDiversity Committee. We did this last year, but we had more money this year for diversity scholarships for those who might not be able to attend. I think next year we might think about reaching out to more STEM groups, but I think the real challenge is finding how to get those diverse students who might not even know about data science in and how to properly host and support them.\r\nGet rid of longer form talks. Keynotes and Lightning talks only. This is probably the most controversial choice that we made. However, we realized that the 10-15 minute talks we had in 2017 were mostly academic ones. Honestly, there are already too many academic conferences out there. We wanted a format that was more accessible and encouraged discussion afterwards, so we stayed with the lightning talks.\r\nHave keynote speakers show newcomers how to join the R Community. We chose Kara Woo and Alison Hill as our keynote speakers for a very specific reason: we wanted to encourage people new to R that they could learn things. Alison gave a wonderful talk about ways to approach learning R; Kara gave a great talk talking about how to contribute to various R-projects on GitHub, especially the tidyverse suite of packages. What I really liked about both their talks was that they emphasized learning by doing.\r\nMoar workshops. We wanted beginners and intermediate people feel like they were learning something, and in a safe learning environment. One piece of feedback from last year was that people wanted more workshops. We created a beginner track and an intermediate track for workshops. I would just like to say that none of the workshop people got paid for their work, and I do wish that some of the attendees realized that before they provided feedback such as “BORING” (seriously? please realize that there are people who develop these, and constructive feedback is always better). All of these workshops were done for free as labors of love, unlike conferences like ODSC.\r\nOrganize Volunteers. We had lots of volunteers this year and we finally were able to figure out roles for everyone to do (registration, nametags, TAs, etc).\r\nDo a visualization fest that wasn’t competitive. I know that everyone loves bake-offs like the DREAM Challenges and Kaggle, but we felt that having a competition was in conflict with the community building we wanted to do with the conference.That, and Tidy Tuesday, were the inspirations for the cRaggy. We wanted people to share ideas with each other and to be constructive with each other. We had three great short talks talking about their approach to the visualization and we shared the data with Tidy Tuesday.\r\nTalk honestly about impostor syndrome. We had a panel with three people (the wonderful Paige Bailey, Kevin Watanabe-Smith and Lilly Winfree) and they all talked about how they deal with impostor syndrome. Some of the lessons are: you feel like less of an impostor the more you do and the more you participate.\r\nHave more downtime. We had feedback last year that there wasn’t enough social time. We built more breaks into the schedule and had a third room (the hack room) dedicated to the “hallway track”: often the best times we’ve had conferences is when we play hooky from conference activities. Some people suggested this year that there maybe was too much downtime. I would say to that, there’s always more opportunity to meet people.\r\nSo that’s why Cascadia R was the way it was this year. In another blog post, I’ll talk more about the fun things that happened this year and our hopes for the next year.\r\n\r\n\r\n\r\n",
    "preview": "posts/2018-06-09-cascadia-r-2018-how-we-planned-it/pull-plan-cascadia-r.png",
    "last_modified": "2021-03-19T19:43:48-07:00",
    "input_file": {},
    "preview_width": 1121,
    "preview_height": 588
  },
  {
    "path": "posts/2018-06-06-self-care-and-self-compassion-in-academia/",
    "title": "Self Care and Self Compassion in Academia",
    "description": "Why self-care is important in academia.",
    "author": [],
    "date": "2018-06-05",
    "categories": [],
    "contents": "\r\n\r\nNote: I am not writing the following to complain, or excuse any past behavior. I am writing this just to be honest and transparent about my current struggles in academia. I hope it helps someone, or encourages other to seek help.\r\n\r\nI have to confess that I haven’t really been feeling all that well the past few months. Right now I am plagued with feelings that I am doing my work as an Assistant Professor wrong. I struggle with this persistent voice in my head that even when I am working at full tilt and beyond, that it’s not enough.\r\nFor most of my life, I have had chronic depression. I am a high functioning depressive; I have managed to get things done when I am depressed. However, this effort comes at the cost of self-care. I really think that some past posts have really come from a place of high stress and high anxiety. I apologize for the harsh tone of this post. I am also struggling with burnout at this point. I am beginning to feel like a lot of my efforts to encourage interdisciplinary collaborations are not feeling very productive. Part of this has to do with internal politics.\r\nI don’t think my depression is an excuse for my past behavior. The lack of self-care, however, is a major cause. When I don’t take care of myself, I reach a place of high stress and high anxiety and I can’t think straight. If I have been hurtful or bullying to others in any way because of this, I apologize.\r\nI still struggle with impostor syndrome. I do think that in many ways, this struggle has helped me become more compassionate as a teacher, remembering what concepts I struggled with. I have been trying my best to keep up with the added responsibilities of a faculty member: mentoring students, writing new course material, doing outreach, and also trying to keep the lights on by doing research (I won’t get into grant writing here; that’s another major depressive kettle of fish). I feel like I’ve currently been a disappointment as a faculty member so far.\r\nI am currently in therapy, which has been very helpful in understanding what problems I can address and what problems that are currently endemic to the academic system. I don’t know of any other field where one can accomplish a lot yet still feel like a failure.\r\nThe hardest thing for me is saying no, especially to students. But I realize that I can’t really be my best for students without taking care of myself. That balance between being considerate of others and also being considerate of my self is something that I am struggling with as a faculty member.\r\nI guess my point being is that I need to reframe saying no as being protective of myself and my current students rather than registering the disappointment when I say no. I’d like to help people, but I can help people better when I’m feeling well and better. Part of this may be coming to grips that academia may not be my place in the world if it demands that I sacrifice my mental health just to stay where I am.\r\nSo for the time being, I’d like to focus on getting better and feeling better. For your sake and mine. I will try to welcome newcomers to data science the best I can - just realize that what I may be able to do for you is a little limited right now.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T19:39:59-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2018-05-17-a-introvert-s-survival-guide-to-conferences/",
    "title": "A Introvert's Survival Guide to Conferences",
    "description": "Are you an introvert? Here's how to make conferences easier.",
    "author": [],
    "date": "2018-05-17",
    "categories": [
      "social",
      "networking"
    ],
    "contents": "\r\nIn academia, it’s inevitable to have to travel and present at conferences and meetings. As an introvert, I’ve been trying to compile a few tips that have helped me navigate large conferences so I don’t feel overwhelmed.\r\nIt is unfortunate that though the academic community has many introverts, conference and meeting structure is heavily biased towards extroverts. (No offense to extroverts, but some of you can sometimes seem like blowhards to us introverts.)\r\nThe question for introverts is how to connect with people at meetings while being true to our nature. We value meaningful and deep connections rather than shallow ones.\r\nSet Yourself Up For Success. Be prepared. If you can, try to connect with people or identify the people you want to meet before the conference even starts. Bring things that make you comfortable. A sweater, water, candy/energy bars. If there are sessions that look interesting, look at the author’s previous papers and think of questions beforehand. An introvert’s strength is that they are good at preparing for things. Use that preparation to your advantage.\r\nBe Curious, Not Scared. You are a curious person. If you weren’t, you wouldn’t be in science. Use that curiosity to connect. Wonder about things. Think about where research could go.\r\nBe the Host, Not the Hosted. According to Susan Cain, introverts do very well socially when they have a specific role. I like moderating sessions for this reason. I’m pretty good at being amiable and making other people comfortable in such situations. By being thoughtful and helping people with their problems, you can form connections.\r\nIt’s Totally Ok to Take a Break. It’s called self-care. Remember, introverts find social situations draining. Go outside for a few minutes, or find a corner that’s quiet and secluded, look at websites on your laptop. Just don’t withdraw. It’s a break, not a jailbreak.\r\nAccept That You’ll Miss Out. Emphasize quality over quantity. As an introvert, I am constantly feeling guilty about not going to every session and meeting people. FOMO can drive me to the point of being overwhelmed. But the truth is, if I can meet two or three people that I can connect with and two or three talks I find inspiring, I consider that a good meeting.\r\nMake Yourself Comfortable at Social Functions. Introverts can do very well socially when the situation is proscribed and the roles are clear, which is why I like poster sessions. There’s a limited set of questions you can ask and be asked. You can also do your homework by looking at the posters before you meet the person. Also: I hate asking public questions in meetings. (This again, is where extroverts can sometimes seem like blowhards to me. Bless their hearts.) I really prefer to go up to the speaker afterwards and try to have a meaningful conversation.\r\nRemember That Most People Are Equally Nervous. Be kind. Be compassionate to yourself and to others. This will make you more relatable. When you focus on making others comfortable, you concentrate less on your own nervousness. Kindness goes a long way in these situations. Help someone out who’s struggling.\r\nAsk Questions and Listen. Again, other people at conferences want to be heard and connect. You may run into raging egotists who don’t listen to you. It’s ok to politely disengage from the conversation. But there is something always interesting about everyone.\r\nGauge When You’re Exhausted. As an introvert, being with people can be draining. At some point, enough is enough. Take the evening off, grab something to go, and watch tv or read a book in your hotel room alone. It’s ok, no one is keeping score of how many social events you are going to. Again, it’s ok to not go to the big reception (unless you’re giving a poster at that time, of course).\r\nIt’s OK, the Right People Will Like You. You will eventually find people you want to talk to. Nurture these relationships. If someone gives you their card, follow up on it. It’s a sign of wanting to make connections.\r\nDon’t Expect The World of Each Social Interaction. I think sometimes we idealize what our perfect interaction would be. We get disappointed when our interactions are less than that. Prepare to be pleasantly surprised, but don’t get bored and wander off. Respect goes a long way, and also serendipity is good. Try to learn more outside your field.\r\nIt’s Totally Okay to be Awkward. Just own it. Most scientists are awkward in some way. (I know that I am, stop denying it people.) Being awkward is a way of being vulnerable - and being vulnerable is a way of connecting. I sometimes consider wearing an “I’m an introvert” button at conferences. At least it would be a good conversation starter. So go ahead, wear something quirky that you like. It can serve as a signal to find like minded people. Remember, own your awkwardness.\r\nBreathe. Conferences can feel like scary and unsafe situations to introverts. If you feel agitated, don’t force it. Take a moment and breathe.\r\nThe world of conferences doesn’t really value introverts, but it needs us (at least there are some people thinking about making conferences more introvert friendly). We’re thoughtful, slow to react, but we can synthesize and bring deeper understanding. Give us space to think and be ourselves, and we will contribute and add diversity to the conversation.\r\nFor more information\r\nThere are lots of blogs written about this. Here are some of my favorites.\r\nHow to Make the Most of a Conference as an Introvert\r\nHow to Survive Big Conferences As an Introvert\r\nHow Introverts can Make the Most of Conferences\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T19:31:30-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2018-04-25-health-informatics-course-materials/",
    "title": "Health Informatics Course Materials",
    "description": "Links to my lectures for our HSMP410 course.",
    "author": [],
    "date": "2018-04-25",
    "categories": [
      "oer",
      "open-education",
      "informatics"
    ],
    "contents": "\r\nSorry for the lack of posts. I have been busy with co-teaching our Health Informatics course (HSMP410) for the OHSU/PSU School of Public Health.\r\nI’m trying to make most of my lectures activity-driven for my students, who are Community Health Education and Nursing majors. I believe that you can teach mathematical concepts visually, so I am experimenting with using LearnR/Shiny to teach the basics of data literacy. I’m also using datacamp-light to show my students a simple intro to data science.\r\nMore information here: HMSP410 Health Informatics and the HMSP410 repository\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T19:30:25-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2018-04-04-a-simple-intro-to-genome-wide-association/",
    "title": "A Simple Intro to Genome Wide Association",
    "description": "Notes on our preprint about synthetic clinical data.",
    "author": [],
    "date": "2018-04-04",
    "categories": [
      "teaching"
    ],
    "contents": "\r\nThis term, I’m co-teaching an undergraduate course for the PSU/OHSU School of Public Health called Health Informatics with a number of my collegues in my department, including Bill Hersh, Eilis Boudreau, Karen Eden, and Virginia Lankes. We’re trying to give students a feel for what informatics is about in an accessible way.\r\nI’m trying to make the lectures as understandable as I can. This week we tackled Genome Wide Association Studies and discussed the strength of evidence behind SNP variants associated with phenotypes. We ended with an activity where they queried the GWAS catalog for information on particular SNP variants.\r\nThe repo for my lectures is here and will be updated as the course goes along: https://github.com/laderast/HSMP410 The lecture is here: An Introduction to Bioinformatics: Genome Wide Association and the activity is here: SNP In class assignment. All my material is free to use and released under Apache 2.0, so if this is interesting to you, please feel free to fork it and remix it!\r\n\r\n\r\n\r\n",
    "preview": "posts/2018-04-04-a-simple-intro-to-genome-wide-association/proportions-hsmp410.png",
    "last_modified": "2021-03-19T19:28:38-07:00",
    "input_file": {},
    "preview_width": 829,
    "preview_height": 395
  },
  {
    "path": "posts/2018-02-28-data-science-and-systems-science/",
    "title": "Data Science and Systems Science",
    "description": "A talk about how system science and data science are connected.",
    "author": [],
    "date": "2018-02-28",
    "categories": [
      "data-science",
      "systems"
    ],
    "contents": "\r\nI gave a talk for the Portland State University Systems Science seminar called How are Data Science and Systems Science Connected?. In this talk, I was highlighting current blind spots in Data Science that I think Systems Science approaches can address, especially that of interactions between features. I talked a little about my dissertation research (surrogate oncogenes), and the problem of black-box interpretability of predictive models.\r\nIf you’re interested in listening to the recording, the playback is available here: https://us.bbcollab.com/recording/059acf5cfed64f9abbf7cf432fdfb566\r\nSlides are here: https://laderast.github.io/sysc_data_sci\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T19:26:43-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2018-01-23-shiny-workshop-materials-posted/",
    "title": "A gRadual Introduction to Shiny",
    "description": "An workshop introduction to Shiny",
    "author": [],
    "date": "2018-01-24",
    "categories": [
      "visualization",
      "R"
    ],
    "contents": "\r\n\r\n\r\n\r\nFigure 1: Learning the flow of information between server and ui\r\n\r\n\r\n\r\nI just gave a workshop teaching the basics of Shiny (the interactive web visualization framework) for a group of PDX R users. We had 10 people attend, and most of the attendees managed to get through the material and had lots of good questions. I really enjoyed talking with everyone and I hope everyone learned something. We’re planning to give the workshop again to the larger PDX R user community, and some of the attendees last night have volunteered to be TAs.\r\nThe workshop materials consist of a GitHub repo and a Markdown document that can be done either in person or independently. The materials are freely available under an Apache 2.0 License.\r\nIn the workshop, we build a flexible csv (comma separated value) explorer that can load in csv data files with adaptive controls and tooltips.\r\nIn terms of packages, the workshop uses the tidyverse (mostly dplyr and ggplot2), and plotly to show some basic programming patterns in shiny:\r\nConnecting controls to ggplot2 aesthetics\r\nFiltering data using reactives\r\nThe observe/update_ pattern\r\nTooltips (the hard way/the plotly way)\r\nThe final product\r\nI’d love for more people to take a look at the workshop and would love any suggestions for making it better!\r\n\r\n\r\n\r\n",
    "preview": "posts/2018-01-23-shiny-workshop-materials-posted/shiny-architecture.png",
    "last_modified": "2021-03-19T19:18:53-07:00",
    "input_file": {},
    "preview_width": 989,
    "preview_height": 373
  },
  {
    "path": "posts/2018-01-15-if-you-want-to-talk-with-me-for-an-informational-interview/",
    "title": "If you want to talk with me for an informational interview",
    "description": "I get a lot of requests for informational interviews. Here's how to actually get one.",
    "author": [],
    "date": "2018-01-15",
    "categories": [
      "talking"
    ],
    "contents": "\r\n\r\n\r\nNote: I have come to believe that this post is way too harsh and unwelcoming to people interested in data science. I will post an update to this, and a FAQ for those who want informational interviews. But in the spirit of showing my mistakes, I’ll leave this up here.\r\n\r\n\r\nI have had many people who have asked me for informational interviews. They tell me that they are interested in Data Science and want to hear about what I do on a day to day basis. To be honest, I’ve begun to dread these kinds of interviews.\r\nInevitably, I spend a lot of energy explaining what I do to someone who rarely follows up. Consequently, I don’t find these interviews rewarding at all. So I’ve written this post so that I have a better time doing these kinds of interviews.\r\nI reserve the right to refuse interviews from people who do not read this.\r\nDo your homework. Please don’t expect me to give the five minute spiel about my research, hoping to look for an “in”. Please do some research and try to ask interesting questions about my work. I’ve given you plenty of resources on this website to know more about me. Ask me about my software, ask me about teaching, ask me carefully thought questions about my research.\r\nDon’t offer to buy me coffee. If I talk with you for 30 minutes, know that my time is worth far more than a cup of coffee. Instead, offer to pay it forwards. Volunteer with a group that does scientific communication or education; I don’t work with people who aren’t willing to teach others. I don’t work or talk with selfish people, having been burned many times by such people.\r\nBe specific in your ask. Asking about what next steps to take in learning data science and where to get a job is not specific enough. Again, do your research. What kinds of Data Science are you interested in? Are you interested in predictive analytics in healthcare? Or are you interested in systems modeling of disease? Be specific, and if you ask for something, make sure I can achieve it in five minutes or less.\r\nDon’t ask for a job, ask for connections. I know a decent number of people around Oregon and OHSU, so if you want me to introduce you to one of my connections, I’m happy to. If I know someone, I’m happy to do this, since it’s usually a five-minute ask.\r\nFollow up, and be willing to return the favor. Even a nice thank-you email is good. I’m happy to make you a Linkedin connection, if it means I can help someone else further down the line. If I expend energy on you, I’d like to see my impact. If my efforts meant that you managed to find a job, please let me know!\r\nRead Give and Take. This book by Adam Grant really struck me as the way to actually network. In short, I learned that if I want a return on my energy expenditure, I have to spend my energy on Givers, or people who help others. I am a Giver, but I now tend only to give informational interviewers to other Givers. The rest are too draining for me.\r\nI have given so many of these interviews and have gotten nothing from them. Not even a follow-up, which really is bad practice. So, if I’m considered difficult to approach about these, know it is because your previous askers have really been an energy drain and have been inconsiderate Takers. Make it interesting for me and be considerate. I’m much more likely to help you.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T19:15:13-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2017-12-19-understanding-tidyeval/",
    "title": "Understanding Tidy Evaluation in R",
    "description": "A metaphor for understanding Tidy Evaluation",
    "author": [],
    "date": "2017-12-19",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nEnter quosures\r\n\r\nWhy Should I Care????\r\nWith quosures, values can come along for the ride\r\nWhat about lots of arguments?\r\nWhat about expressions?\r\nBe really careful with !!\r\nOther applications\r\nFor more information\r\n\r\n\r\nIntroduction\r\nHave you ever had something that no matter how many times someone explained it, you really had no idea what it was for? For me, that was Non Standard Evaluation (NSE) in R, and its newer cousin Tidy Evaluation, or tidyeval. I had a real learning block about it. I really wanted to understand it, but for some reason I just really wasn’t getting the general concepts.\r\nWhat is evaluation, really? For the longest time, I was extremely confused about it. When you provide an expression to R such as:\r\n\r\n\r\nlibrary(tidyverse)\r\nlibrary(rlang)\r\nthis_variable <- 2\r\nthis_variable * 6\r\n\r\n\r\n[1] 12\r\n\r\nYou notice that there is an output to this_variable * 6, which is 12. Evaluation is really about looking up variable names in an environment and then acting on the results. What is going on here is that R looks for an object that is named this_variable in our global environment, and then returns the value, 2, which it then substitutes in the expression. So our original expression:\r\n\r\n\r\nthis_variable * 6\r\n\r\n\r\n[1] 12\r\n\r\nBecomes this expression:\r\n\r\n\r\n2 * 6\r\n\r\n\r\n[1] 12\r\n\r\nWhich R knows how to calculate, the output of which is 12. But sometimes you want to pass an expression or a variable, as is, without evaluating it first. The best case for this is to passing a variable into a function. We can do this by wrapping them up in quosures or enquosures.\r\nEnter quosures\r\nA quosure and an enquosure can be thought of as envelopes around an object. They obscure certain properties of the object until they can be delivered into a function. The envelopes basically are a way to sneak variables and expressions into a function’s environment. When the envelope is in the function, we can open it up and evaluate what’s in the envelope. The trick to NSE and tidyeval is that we can control when the function evaluates the expression, by controlling when we open this envelope. We do this by using the UQ() or !! functions.\r\nIn other words, quosures and enquosures are ways to prevent R from looking up a variable’s value in our current environment (usually the global environment), and delay this lookup until we get them into the environment of interest. This might be one level down (in our function of interest), or several levels down (in a function called by our function).\r\nThe point is, R won’t open the envelope with our variable in it until we tell it to.\r\nWhy Should I Care????\r\nThe short answer: if you want to write functions that directly work with the tidyverse, you need to understand tidyeval.\r\nThe best way to understand why you need to do this is to write a function that takes a data.frame and a reference to a column within that data.frame. You might notice that we can directly refer to a column in a data.frame for select, for example:\r\n\r\n\r\nmtcars %>% select(cyl) %>% head(10)\r\n\r\n\r\n                  cyl\r\nMazda RX4           6\r\nMazda RX4 Wag       6\r\nDatsun 710          4\r\nHornet 4 Drive      6\r\nHornet Sportabout   8\r\nValiant             6\r\nDuster 360          8\r\nMerc 240D           4\r\nMerc 230            4\r\nMerc 280            6\r\n\r\nWhy does that work? This is the power of NSE and tidy evaluation. Basically, by wrapping up cyl in an envelope, we prevent R from evaluating it right away. We can then pass the envelope into other functions, or environments, and then tell R to remove the envelope and then evaluate it.\r\nLet’s try and mimic this. We’ll write a function grab_col(x, colname) which returns the values in the column whose name we ask for as an object. If we do this, without tidyeval, this will happen.\r\n\r\n\r\ngrab_col <- function(x, colname){\r\n  x %>%\r\n    pull(colname)\r\n}\r\n\r\n\r\n\r\nTry running grab_col(mtcars, colname=cyl). You’ll get an error that cyl does not exist as an object. Augh! This is harder than we thought.\r\nHow can we fix this? We can wrap colname up in an enquosure using the enquo() function. Once it’s into pull(), we use UQ() to open the envelope and R knows that it should look in the data.frame’s environment for our colname:\r\n\r\n\r\nlibrary(rlang)\r\n\r\ngrab_col <- function(x, colname){\r\n  ##wrap up colname in an enquosure\r\n  cc <- rlang::enquo(colname)\r\n\r\n  ##use UQ to evaluate it within the pull function\r\n  x %>%\r\n    pull(\r\n      ## unquote and evaluate (open the envelope!)\r\n      UQ(cc)\r\n      )\r\n}\r\n\r\ngrab_col(mtcars, colname=cyl)\r\n\r\n\r\n [1] 6 6 4 6 8 6 8 4 4 6 6 8 8 8 8 8 8 4 4 4 4 8 8 8 8 4 4 4 8 6 8 4\r\n\r\nNow try grab_col(mtcars, colname=cyl). Nifty, huh?\r\nWith quosures, values can come along for the ride\r\nWhy would we use quosures at all, instead of enquosures? Because with quosures we can actually bring some needed values along for the ride.\r\n\r\n\r\n\r\nWhat about lots of arguments?\r\nThat’s what quos() is for. Ever notice that you can specify a number of unnamed arguments by specifying a ... in your function definition? And did you ever notice that select() can take lots of arguments such as select(mpg, cyl, wt)? That is the power of ... combined with quos()!\r\nquos takes a list and makes each element of the list a quosure.\r\n\r\n\r\n\r\nWhat about expressions?\r\nSay we wanted to pass an expression such as cyl > 2 into our function. We’ll need to wrap it up in enexpr() instead of enquo():\r\n\r\n\r\nfilter_on_column <- function(x, col_expr){\r\n  c_e <- rlang::enexpr(col_expr)\r\n\r\n  x %>%\r\n    ## The !! (called a bangbang) is just another way to use UQ()\r\n    ## I don't really like it, I'd rather use UQ()\r\n    filter(!! c_e)\r\n}\r\n\r\n#pass in a simple expression\r\nmtcars %>% filter_on_column(cyl > 2) %>% head(5)\r\n\r\n\r\n                   mpg cyl disp  hp drat    wt  qsec vs am gear carb\r\nMazda RX4         21.0   6  160 110 3.90 2.620 16.46  0  1    4    4\r\nMazda RX4 Wag     21.0   6  160 110 3.90 2.875 17.02  0  1    4    4\r\nDatsun 710        22.8   4  108  93 3.85 2.320 18.61  1  1    4    1\r\nHornet 4 Drive    21.4   6  258 110 3.08 3.215 19.44  1  0    3    1\r\nHornet Sportabout 18.7   8  360 175 3.15 3.440 17.02  0  0    3    2\r\n\r\n#pass in a compound expression\r\nmtcars %>% filter_on_column(cyl > 2 & qsec > 18) %>% head(5)\r\n\r\n\r\n                mpg cyl  disp  hp drat    wt  qsec vs am gear carb\r\nDatsun 710     22.8   4 108.0  93 3.85 2.320 18.61  1  1    4    1\r\nHornet 4 Drive 21.4   6 258.0 110 3.08 3.215 19.44  1  0    3    1\r\nValiant        18.1   6 225.0 105 2.76 3.460 20.22  1  0    3    1\r\nMerc 240D      24.4   4 146.7  62 3.69 3.190 20.00  1  0    4    2\r\nMerc 230       22.8   4 140.8  95 3.92 3.150 22.90  1  0    4    2\r\n\r\nBe really careful with !!\r\nIn the above example, we used !!, called a bangbang, to unquote and evaluate our expression. Be really careful with what you put after the !!, since everything after it will be evaluated. If you have elements after the expression you don’t want to unquote, wrap the !! up in a set of parentheses:\r\n\r\n\r\nbang <- function(val2){\r\n  x <- enquo(val2)\r\n  return((!! x) + 10)\r\n}\r\n\r\nbang(5)\r\n\r\n\r\n\r\nOther applications\r\nOne of the coolest applications of NSE is to write code that writes code. You have to be very careful with this, but it’s potentially really useful. On my list of things to do for my flowDashboard package is to write code that generates a standalone app given the data objects you supply it.\r\nFor more information\r\nHopefully this was helpful in understanding NSE and tidyeval. I find that sometimes I have to write things up so I more clearly understand it. So, if anything, writing this was useful for clarifying my thinking.\r\nI’m indebted to Edwin Thoen’s code examples that helped me finally understand what’s going on with tidyeval: https://edwinth.github.io/blog/dplyr-recipes/\r\nI didn’t really talk about Base-R’s NSE, but I would say that this should at least give you enough background to understand what’s going on there.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-11-30T07:30:58-08:00",
    "input_file": "2017-12-19-understanding-tidyeval.knit.md"
  },
  {
    "path": "posts/2017-12-14-using-synthetic-data/",
    "title": "Using Synthetic Data for Teaching Data Science",
    "description": "Notes on our preprint about synthetic clinical data.",
    "author": [],
    "date": "2017-12-14",
    "categories": [],
    "contents": "\r\nHi Everyone, our paper called Teaching data science fundamentals through realistic synthetic clinical cardiovascular data is now available to read on Biorxiv.\r\nIn this paper, we talk about a dataset that we synthesized for teaching aspects of clinical data that may be tricky to understand in data science. This dataset is interesting because it’s derived from a multivariate distribution based on real patient data, modeled as a Bayesian Network. Even when we knew true marginals for the real data, there was a lot of fine tuning to the Bayesian Network.\r\nWe’ve used this dataset for a couple of classes, and we’ve found that it helps highlight real issues in predictive modeling of clinical data. One of the largest is that most predictive models are based on a much older patient cohort (50+), which means that we don’t know much about how to predict cardiovascular risk in younger patients. Part of the teaching exercise is having the students choose a cohort of interest and then attempt to predict on that patient cohort.\r\nThe data is currently available as an R package here, including vignettes about how the data was generated: https://github.com/laderast/cvdRiskData\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T19:19:57-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2017-11-07-ODSC-Notes/",
    "title": "Notes on Open Data Science Conference West 2017",
    "description": "Some notes on ODSC West 2017.",
    "author": [],
    "date": "2017-11-07",
    "categories": [],
    "contents": "\r\nI just came back from the Open Data Science Conference (ODSC) in San Francisco and I found it really stimulating and interesting. I learned a ton, met some great people working in very different fields, and overall found it quite worthwhile.\r\nHere are some of the highlights from my notes:\r\nWorkshops\r\nscikit-learn intro Workshop and Advanced\r\nI admit that I am not really a Python person. But I am helping to develop some materials for an introductory workshop and I found this workshop and its materials to be a very beginner-friendly to scikit-learn and machine learning concepts, much like caret for R. All the slides and workshop materials are available at the above links.\r\nSparklyR Workshop\r\nI liked this workshop from John Mount of Win-Vector. It started out with a dplyr intro, and introduced us to the basics of Apache Spark, which is a cluster-computing based machine learning framework, which is designed to do very large queries and machine learning. RStudio’s Edgar Ruiz managed to get us each an RStudio Pro Instance running on AWS with all the required packages installed so we could test out the SparklyR package, which uses dplyr’s commands to run Spark jobs.\r\nIn-Memory Computing Essentials for Data Scientists\r\nThis was an introduction to Apache Ignite, which is a distributed, in-memory database that can be leveraged by different languages. The really interesting thing about Ignite is that it will colocate related data on the same cluster node, resulting in rapid queries within each node. I think this technology will become very important as we need more datasets to be openly accessible to compute on.\r\nTalks\r\nThese were the most interesting talks that I attended.\r\nVisually Explaining Statistical and Machine Learning Concepts\r\nThis was a great talk by Mike Freedman about his process of how he put together D3.js based visualizations to explain some statistical concepts. I thought the explanation of his process (isolate specific ideas, identify data structures, leverage visualization algorithms). Check out the slides above. They’re very cool.\r\nThe Wonder Twins: Data Science and Human Centered Design\r\nThis was a really interesting talk about the interplay between data science and design in helping encourage a mobile money system in Tanzania. It was inspiring to see how they had both designers and data scientists embedded and looking at how the mobile payment system worked. One interesting example was doing network analysis of the Mobile Money Agents, who distribute cash. They targeted a highly influential group of these agents based on this analysis. Very cool.\r\nThe People’s Data and The Deontology of Data Science\r\nI thought these were really interesting sides about the human side of data science. DJ Patil, who was chief data scientist under the Obama administration, talked about citizen-driven data projects and how it enabled a number of advances. The most interesting case was basically a parent built an online community of people who had a very rare disease condition so he could help his son with the condition.\r\nIgor Perisic (of LinkedIn) followed this with a talk about ethical issues in data science. In particular, he identified three different areas to concentrate on: 1) The Ethics of Data, 2) The Ethics of Algorithms, and 3) The Ethics of practice. He concentrated on the recent New York Times article about using machine learning to identify potential re-offenders in the prison system. The lack of transparency in how the algorithm identifies potential reoffenders is a huge ethical problem.\r\nIn all, I had an interesting time and I met lots of people in industry, which was a nice contrast to the academic side of things.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T18:07:51-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2017-07-05-interesting-user2017talks/",
    "title": "Interesting useR 2017 Talks",
    "description": "useR 2017 talks and links.",
    "author": [],
    "date": "2017-07-05",
    "categories": [],
    "contents": "\r\nSince I didn’t get to go to useR 2017 this year, I’m compiling the interesting talks. This is an ongoing list.\r\nhttps://user2017.sched.com/event/AxqM/automatically-archiving-reproducible-studies-with-docker\r\nhttps://user2017.sched.com/event/Axq4/clouds-containers-and-r-towards-a-global-hub-for-reproducible-and-collaborative-data-science\r\nhttps://user2017.sched.com/event/Axq9/scraping-data-with-rvest-and-purrr\r\nhttps://user2017.sched.com/event/Axq1/using-the-alphabetr-package-to-determine-paired-t-cell-receptor-sequences\r\nhttps://user2017.sched.com/event/AxqG/show-me-the-errors-you-didnt-look-for\r\nhttps://user2017.sched.com/event/AxqR/community-based-learning-and-knowledge-sharing\r\nhttps://user2017.sched.com/event/AxqT/r-based-computing-with-big-data-on-disk\r\nhttps://user2017.sched.com/event/AxqA/codebookr-codebooks-in-r\r\nhttps://user2017.sched.com/event/Axor/how-we-built-a-shiny-app-for-700-users Useful concepts: reactiveTrigger to force a rerender.\r\nhttps://user2017.sched.com/event/AxsL/ensemble-packages-with-user-friendly-interface-an-added-value-for-the-r-community\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T18:06:19-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2017-06-28-HowToNotBeAfraid/",
    "title": "How to Not Be Afraid of Your Data",
    "description": "A Past Workshop about EDA and data exploration.",
    "author": [],
    "date": "2017-06-28",
    "categories": [],
    "contents": "\r\nI’m going to be giving a talk for the PDX RLang Meetup on July 11 called “How to Not Be Afraid of Your Data: Teaching EDA using Shiny”. Abstract below.\r\nMany graduate students in the basic sciences are afraid of data exploration and cleaning, which can greatly impact their downstream analysis results. By using a synthetic dataset, some simple dplyr commands, and a shiny dashboard, we teach graduate students how to explore their data and how to handle issues that can arise (missing values, differences in units). For this talk, we’ll run through a simple EDA example (combining two weight loss datasets) with a general data explorer in shiny that can be easily customized to teach specific EDA concepts.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T18:05:38-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2017-06-07-CascadiaRNotes/",
    "title": "Some Lessons We Learned Running Cascadia-R 2017",
    "description": "How we started and ran the first PNW Regional R Conference, Cascadia-R",
    "author": [],
    "date": "2017-06-07",
    "categories": [],
    "contents": "\r\nWell, the first Cascadia R Conference has come and gone. I have to say that it was super fun, and well attended (over 190 people!). I had a blast meeting and chatting with everyone. Hopefully, we showed newbies that R is learnable and others that there are lots more things to learn about R.\r\nThe following is my attempt to document what we learned from organizing Cascadia-R. It’s not complete; I may add and subtract from it as I think of more things to say about the planning process.\r\nDecide the tone. Our goals with Cascadia-R were modest. We wanted to get a diverse group of R users together in a safe and encouraging environment. We wanted our workshops to be accessible to even beginners, and encourage them in the use of R.\r\nPart of meeting these goals of this is setting the tone. We really wanted to encourage all levels of R users to attend. All of our flyers, emails and promotional tweets encouraged beginners to come. We got help with making a Code of Conduct for the conference. Part of creating a supportive environment is encouraging diversity in both speakers and attendees. We did our best to reach out to current groups that encourage diversity, such as Women in Science Portland, and R-Ladies Global.\r\nWe also offered diversity scholarships to encourage people from diverse backgrounds to attend, and made diversity part of our criteria for selecting talks.\r\nStart planning early. As junior faculty at OHSU, I’m lucky enough to be able to book facilities here, including the large learning studios where we held the conference. Having the venue secured early on made the remaining logistics of the conference much easier.\r\nMuch like wedding planning, there are plenty of conference planning services out there who would be happy to take over aspects of your conference, for a fee. You can spend however much you want to on these things. However, I believe that such a approach is not financially responsible. I also feel that taking a more DIY/bespoke approach can make a conference most engaging (see csvconf). We tried to do most things ourselves (including design, promotion, talk submission, workshops, and registration/logistics).\r\nIterate your budget. Think of a conference as a project with lots of linked dependencies. Your first plan is probably not going to be your final plan. Start a plan, iterate, realize that things are going to shift, have a backup plan. What if registration is not going to pay for the venue rental fee? Talking to simpatico sponsors can take much of the financial stress. In our case, the Rstudio foundation and ROpenSci stepped up to contribute some money as a cushion.\r\nRemember, there are fixed costs (such as venue rental, and recording/streaming costs) and variable costs that scale with the number of attendees (food, badges, alcohol). Separate these out. When possible, pay off the fixed costs first, so that it’s easier to manage the variable costs.\r\nAgain, who is your desired audience and can they afford your conference? We decided to make our conference as affordable as possible to encourage as many different kinds of people to attend. We initially wanted to make attendance free for students. The problem with free is that literally it’s free. It has no value in the mind of a person who accepts free admission. So we decided to charge students a small fee just to emphasize that the conference has value.\r\nTalk with others who have done it. We were very clueless about much of the logistics side at OHSU. I managed to get through by talking with a number of people here (including Robin Champieux and Shannon McWeeney) who have done conferences here at OHSU. Thank you so much for your invaluable advice.\r\nEncourage each other and delegate. No one of us could have done all of the conference planning alone. Each of us took on various aspects of conference organization and brought in the others as support as needed. Some of us selected talks, some of us did design, and we all pitched in to get registration working as efficiently and quickly as possible.\r\nOur slack channel on pdxdata.slack.com is full of our decisions. Slack was so useful as a planning mechanism that we only met online via Google Hangouts a few times, and only had two in-person planning sessions.\r\nBe Willing to Make Mistakes. Lord knows I made a bunch of mistakes when I made announcements and hosted the lightning sessions. However, I owned up to these mistakes, shrugged, and moved on. Improvising in the moment can be just as important as planning.\r\nThink about the future. What should the next Cascadia-R look like? I know it just happened, but we’re trying to envision what it would look like. Based on the feedback we’ve gotten so far, people really want more workshops!\r\nIn a following post, I’m also going to talk about lessons I learned when Chester and I put on our tidyverse workshop.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T18:04:48-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2017-04-19-Breadth-and-depth/",
    "title": "On Breadth and Depth in Your Academic Career",
    "description": "Why Learning and hobbies outside of your field are important.",
    "author": [],
    "date": "2017-04-19",
    "categories": [],
    "contents": "\r\nI was talking with a student and they were complaining that when at conferences, they would try to inject other topics of interest (such as cooking) into discussions with colleagues. Unfortunately, one of the after effects of this was that they were looked at as “not a serious scientist”. There’s an expectation that a scientist must be all depth, only talking and thinking about their sub-field.\r\nAs a cross disciplinarian, I have to say that is hogwash. The genesis of so many creative ideas in science has happened because of cross-pollination across disciplines. For example, microwave technology might never have been invented without the intersection of disciplines. We know that the Arts Foster Scientific Success - a large number of Nobel and National Academy members do art in some form or other. Bernstein et al theorize that\r\n\r\n“there exist functional connections between scientific talent and arts, crafts, and communications talents so that inheriting or developing one fosters the other.”\r\n\r\nHaving breadth and depth enables you to make connections that no one else has. It is the hallmark of a curious and creative person. These kinds of people are desparately needed to push science in new directions.\r\nI have a parallel career in performance and improvisational music. Music, for me, is endlessly inspiring and has forced me out of my introverted shell. One of the reasons I took up cello is that I can play many roles; accompanist, rhythm, solo. This flexibility in playing music has translated to my flexibility in collaboration. Being able to adjust to new circumstances and improvise new ideas to explore is a critical component of being a responsible scientist. My background improvisation has helped me pivot ideas. I have become less attached to dogmatic ideas. Many of my good ideas come from idle wondering about data that has captured my imagination. This is part of the reason why I teach students how to explore their data.\r\nSo, the next time another scientist looks down at you for being a polymath, pity them. Their world and their ideas are not as rich as yours.\r\nFurther Reading\r\nThe Correlation Between Arts and Crafts and a Nobel Prize\r\nArts Foster Scientific Success\r\nDual Thinking for Scientists\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T15:43:18-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2017-04-17-Building-A-Peer-Mentoring/",
    "title": "Fostering a Peer Mentoring Culture",
    "description": "A bit about BioData Club",
    "author": [],
    "date": "2017-04-17",
    "categories": [],
    "contents": "\r\nI realize that it has been an embarrasingly long time since I updated this blog. I had all sorts of grandiose plans for it, and I think my problem was that I was thinking too broad, too pie-in-the-sky. I’m going to try to focus on short and informative blog posts.\r\nOne of the things that I have been thinking about graduate school is the idea of building a Peer Mentoring culture in our department. I believe that students should help and support each other, and we need to provide a forum to do that. Not just assign mentors, but provide a time and a place to do that.\r\nWe try to foster a mentoring culture within our student group, BioData-Club. Students are free to talk about issues that concern them, especially about datasets, and are encouraged to share their experiences of software that they’ve used. I believe that we try to give students a psychologically safe place to talk about their issues with data. We try to make people feel like they’re not alone, and coach beginners so they can get over the hump.\r\nWe’re now embarking on an experiment to reach even more people at OHSU, because we know there are lots of students who struggle with practical skills in data analysis. Our group is growing, and that’s exciting.\r\nI’m going to try and get everyone in our group to write a paper about Peer Mentoring Culture and how to encourage it in other schools.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T18:03:22-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2015-11-19-statcheck-package/",
    "title": "Statcheck Interview",
    "description": "Interesting interview with the developer of statcheck",
    "author": [],
    "date": "2015-11-19",
    "categories": [],
    "contents": "\r\nDue to the usual postdoc busy-ness, I haven’t had the energy to update this blog as much as I would like, but I thought this interview on Retraction Watch from Michèle B. Nuijten, the developer of the R-package statcheck to be fascinating. Her package essentially automates the checking of p-values given published data in papers, from converting the papers from pdf to text, and sees if the calculated p-values are correct. There was a lot of trial and error in parsing known formats for p-values, but now the package is available.\r\nI see an potentially really interesting master’s thesis in forensic bioinformatics in using the package to assess reproducibility of results in a field. Note that the student probably wouldn’t make any friends in high places, but it would be a potentially high impact thesis.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T16:39:56-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2015-05-26-mutational-burden-in-skin/",
    "title": "Somatic Mutations in Skin Paper",
    "description": "More about somatic mutations in skin cancer.",
    "author": [],
    "date": "2015-05-26",
    "categories": [],
    "contents": "\r\nThis paper, High burden and pervasive positive selection of somatic mutations in normal human skin is fascinating. It suggests that the mutational burden is much higher than we expected in skin cells due to UV exposure. In addition, subclones exist in the skin that are positively selected for oncogenes.\r\nIt also makes me want to stock up on sunscreen.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-19T16:36:46-07:00",
    "input_file": {}
  }
]
